In [1]:
import pandas as pd

# DataFrame(data,index,columns,dtype)

In [3]:
pd.DataFrame([10,20,30])

    0
0  10
1  20
2  30

Index compulsory started from 0

In [4]:
import numpy as np

In [5]:
a=np.random.random((4,4))

In [6]:
a

array([[0.16704475, 0.60202246, 0.63625523, 0.43010865],
       [0.18595794, 0.54611978, 0.59479192, 0.37537568],
       [0.60571806, 0.42727061, 0.11950327, 0.77154782],
       [0.89573592, 0.86406435, 0.39440569, 0.89470594]])

In [7]:
pd.DataFrame(a)

          0         1         2         3
0  0.167045  0.602022  0.636255  0.430109
1  0.185958  0.546120  0.594792  0.375376
2  0.605718  0.427271  0.119503  0.771548
3  0.895736  0.864064  0.394406  0.894706

In [8]:
d1=pd.DataFrame(a,index=['p','q','r','s'],columns=['val1','val2','val3','val4'])
d1

       val1      val2      val3      val4
p  0.167045  0.602022  0.636255  0.430109
q  0.185958  0.546120  0.594792  0.375376
r  0.605718  0.427271  0.119503  0.771548
s  0.895736  0.864064  0.394406  0.894706

In [9]:
s=pd.Series(range(1,10))
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [10]:
pd.DataFrame(s) #created a DataFrame using above series s

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [12]:
#we can also create a df using multiple values
emp ={'name' :['ayesha','manju','sid'],
      'post' :['bsc','chem','bio'],
      'emp_id':[101,102,103]}
emp

{'name': ['ayesha', 'manju', 'sid'],
 'post': ['bsc', 'chem', 'bio'],
 'emp_id': [101, 102, 103]}

In [13]:
pd.DataFrame(emp)

     name  post  emp_id
0  ayesha   bsc     101
1   manju  chem     102
2     sid   bio     103

In [17]:
pd.DataFrame(data=[100]) #constructor is in list

     0
0  100

In [18]:
pd.Series(s,index=[0,5,7]) #fetch element from specific indep

0    1
5    6
7    8
dtype: int64

In [25]:
rh = [5,1,4,7]
pd.Series(s, index =rh,dtype='float')

5    6.0
1    2.0
4    5.0
7    8.0
dtype: float64

In [26]:
rh[0]=15
rh

[15, 1, 4, 7]

In [27]:
pd.Series(rh)

0    15
1     1
2     4
3     7
dtype: int64

In [24]:
pd.Series(s,index=rh)

15    NaN
1     2.0
4     5.0
7     8.0
dtype: float64

In [30]:
pd.DataFrame({'shital':range(1,6),'ashish': np.arange(100,105)})

   shital  ashish
0       1     100
1       2     101
2       3     102
3       4     103
4       5     104

Properties of DataFrame

In [31]:
d1

       val1      val2      val3      val4
p  0.167045  0.602022  0.636255  0.430109
q  0.185958  0.546120  0.594792  0.375376
r  0.605718  0.427271  0.119503  0.771548
s  0.895736  0.864064  0.394406  0.894706

In [32]:
d1.shape

(4, 4)

In [33]:
d1.columns

Index(['val1', 'val2', 'val3', 'val4'], dtype='object')

In [34]:
d1.index

Index(['p', 'q', 'r', 's'], dtype='object')

In [35]:
d1

       val1      val2      val3      val4
p  0.167045  0.602022  0.636255  0.430109
q  0.185958  0.546120  0.594792  0.375376
r  0.605718  0.427271  0.119503  0.771548
s  0.895736  0.864064  0.394406  0.894706

In [37]:
d1.size #gives total elements present df is 2d.len(d1)

16

In [38]:
len(d1)

4

In [39]:
d1.shape[0]

4

In [44]:
pq ={'place':['pune','mumbai','kolhapur','goa'],
       'name':['pooja','payal','gouri','pankaj']   }
pq

{'place': ['pune', 'mumbai', 'kolhapur', 'goa'],
 'name': ['pooja', 'payal', 'gouri', 'pankaj']}

In [52]:
x=pd.DataFrame(pq)
x

      place    name
0      pune   pooja
1    mumbai   payal
2  kolhapur   gouri
3       goa  pankaj

#fetch pune records

In [53]:
x.query('place == "pune"')

  place   name
0  pune  pooja